tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeYmd(uint32_t ymd) {
    char text[12];
    snprintf(text, sizeof(text), "%04lu-%02lu-%02lu",
             static_cast<unsigned long>(ymd / 10000UL),
             static_cast<unsigned long>((ymd / 100UL) % 100UL),
             static_cast<unsigned long>(ymd % 100UL));
    Esp32BaseWeb::sendChunk(text);
}

uint32_t cycleStartYmdForEdit(const PlanStore::Plan& plan) {
    const uint32_t today = currentYmd();
    if (today >= 20000101UL && !plan.enabled && plan.lastRunYmd == 0 && plan.cycleStartYmd == PlanStore::DefaultCycleStartYmd) {
        return today;
    }
    return plan.cycleStartYmd;
}

void writeMinuteOfDay(uint16_t minuteOfDay) {
    char text[8];
    snprintf(text, sizeof(text), "%02u:%02u", static_cast<unsigned>(minuteOfDay / 60), static_cast<unsigned>(minuteOfDay % 60));
    Esp32BaseWeb::sendChunk(text);
}

void writeSelected(bool selected) {
    if (selected) {
        Esp32BaseWeb::sendChunk(" selected");
    }
}

void writeChecked(bool checked) {
    if (checked) {
        Esp32BaseWeb::sendChunk(" checked");
    }
}

uint32_t flowRateLiterPerMinuteX100(uint8_t road) {
    if (road < 1 || road > IrrigationPins::MaxRoads) {
        return 0;
    }
    const SettingsStore::RoadConfig& roadConfig = SettingsStore::current().roads[road - 1];
    if (roadConfig.pulsePerLiter == 0) {
        return 0;
    }
    const uint64_t pulseRateX1000 = FlowMeter::pulseRatePerMinuteX1000(road);
    const uint64_t value = pulseRateX1000 * static_cast<uint64_t>(roadConfig.calibrationX1000) * 100ULL;
    const uint64_t denominator = static_cast<uint64_t>(roadConfig.pulsePerLiter) * 1000ULL * 1000ULL;
    return static_cast<uint32_t>(value / denominator);
}

uint8_t parseRoadFromKey(const char* key, const char* suffix) {
    if (!key || !suffix || key[0] != 'r' || key[1] < '1' || key[1] > '4') {
        return 0;
    }
    return strcmp(key + 2, suffix) == 0 ? static_cast<uint8_t>(key[1] - '0') : 0;
}

void writeRoadDisplayName(uint8_t road) {
    const SettingsStore::Settings& s = SettingsStore::current();
    if (road >= 1 && road <= IrrigationPins::MaxRoads && s.roads[road - 1].name[0] != '\0') {
        Esp32BaseWeb::writeHtmlEscaped(s.roads[road - 1].name);
        return;
    }
    Esp32BaseWeb::sendChunk("第 ");
    writeUInt(road);
    Esp32BaseWeb::sendChunk(" 路");
}

const char* valvePinName(uint8_t road) {
    switch (road) {
        case 1: return "GPIO13";
        case 2: return "GPIO14";
        case 3: return "GPIO16";
        case 4: return "GPIO27";
        default: return "-";
    }
}

const char* flowPinName(uint8_t road) {
    switch (road) {
        case 1: return "GPIO34";
        case 2: return "GPIO35";
        case 3: return "GPIO36";
        case 4: return "GPIO39";
        default: return "-";
    }
}

void sendHeader(const char* title, const char* pageClass) {
    (void)pageClass;
    Esp32BaseWeb::sendHeader(title);
}

void sendFooter() {
    Esp32BaseWeb::sendFooter();
}

void redirectTo(const char* path) {
    Esp32BaseWeb::redirectSeeOther(path);
}

void writePageHead(const char* title, const char* subtitle) {
    Esp32BaseWeb::sendPageTitle(title, subtitle);
}

void writeWateringStatusPanel(const char* title) {
    Esp32BaseWeb::beginPanel(title);
    Esp32BaseWeb::sendInfoRowCompact("当前浇水", "各路独立计时、计量和停止。", WateringSession::isActive() ? "浇水中" : "未运行");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>项目</th>");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        Esp32BaseWeb::sendChunk("<th>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</th>");
    }
    Esp32BaseWeb::sendChunk("</tr></thead><tbody>");
    const char* labels[] = {"状态", "目标", "剩余", "水量", "流速"};
    for (uint8_t row = 0; row < 5; ++row) {
        Esp32BaseWeb::sendChunk("<tr><th>");
        Esp32BaseWeb::sendChunk(labels[row]);
        Esp32BaseWeb::sendChunk("</th>");
        for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
            const WateringSession::RoadStatus& status = WateringSession::roadStatus(road);
            const bool enabled = SettingsStore::isRoadEnabled(road);
            uint32_t remainingSec = 0;
            if (status.state == WateringSession::ROAD_RUNNING && status.targetSec > 0) {
                const uint32_t elapsed = (Esp32BaseSystem::uptimeMs() - status.startedMs) / 1000UL;
                remainingSec = elapsed < status.targetSec ? status.targetSec - elapsed : 0;
            }
            const uint32_t pulses = status.lastPulseCount >= status.startedPulseCount ? status.lastPulseCount - status.startedPulseCount : 0;
            Esp32BaseWeb::sendChunk("<td>");
            if (!enabled && row > 0) {
                Esp32BaseWeb::sendChunk("-");
            } else if (row == 0) {
                Esp32BaseWeb::writeHtmlEscaped(enabled ? roadStateLabel(status.state) : "未启用");
            } else if (row == 1) {
                writeMinutesFromSeconds(status.targetSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 2) {
                writeMinutesFromSeconds(remainingSec);
                Esp32BaseWeb::sendChunk(" 分钟");
            } else if (row == 3) {
                writeLitersFromMl(SettingsStore::estimateMilliliters(road, pulses));
            } else {
                writeFixed2FromX100(flowRateLiterPerMinuteX100(road));
                Esp32BaseWeb::sendChunk(" L/min");
            }
            Esp32BaseWeb::sendChunk("</td>");
        }
        Esp32BaseWeb::sendChunk("</tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><div class='actions'>");
    const bool active = WateringSession::isActive();
    const char* disabled = active ? "" : " disabled";
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' onsubmit=\"return confirm('确认停止全部浇水？')&&once(this)\"><input type='hidden' name='source' value='web_page'><input type='hidden' name='road' value='0'><button type='submit'");
    Esp32BaseWeb::sendChunk(disabled);
    Esp32BaseWeb::sendChunk(">停止全部</button></form>");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/water/stop' onsubmit=\"return confirm('确认停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路？')&&once(this)\"><input type='hidden' name='source' value='web_page'><input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><button type='submit'");
        Esp32BaseWeb::sendChunk(WateringSession::isRoadActive(road) ? "" : " disabled");
        Esp32BaseWeb::sendChunk(">停止第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路</button></form>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (!active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "当前未运行", "停止操作会在有水路运行时启用。");
    }
    Esp32BaseWeb::endPanel();
}

void writeManualStartPanel() {
    const SettingsStore::Settings& settings = SettingsStore::current();
    Esp32BaseWeb::beginPanel("手动浇水");
    Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/water/start' onsubmit=\"return confirm('确认开始手动浇水？')&&once(this)\"><input type='hidden' name='source' value='web_page'><div class='fieldgrid'>");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        const bool enabled = SettingsStore::isRoadEnabled(road);
        Esp32BaseWeb::sendChunk("<p class='field med'><label>第 ");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(" 路 ");
        writeRoadDisplayName(road);
        Esp32BaseWeb::sendChunk("</label><span class='tag");
        Esp32BaseWeb::sendChunk(enabled ? " ok" : "");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(enabled ? "已启用" : "未启用");
        Esp32BaseWeb::sendChunk("</span><select name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_enabled'");
        Esp32BaseWeb::sendChunk(enabled ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><option value='1'>浇水</option><option value='0'");
        writeSelected(!enabled);
        Esp32BaseWeb::sendChunk(">");
        Esp32BaseWeb::sendChunk(enabled ? "不浇水" : "未启用");
        Esp32BaseWeb::sendChunk("</option></select><small>选择是否参与本次手动浇水。</small></p><p class='field short'><label>时长</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(settings.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'");
        Esp32BaseWeb::sendChunk(enabled ? "" : " disabled");
        Esp32BaseWeb::sendChunk("><small>分钟，范围 1-240。</small></p>");
    }
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='submit' value='开始浇水'></div></form>");
    Esp32BaseWeb::endPanel();
}

const char* signalQuality(long rssi) {
    if (rssi >= -60) return "优秀";
    if (rssi >= -70) return "良好";
    if (rssi >= -80) return "一般";
    return "较弱";
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    sendHeader("首页", "page-overview");
    writePageHead("首页", "查看当前状态，并执行即时浇水和停止操作。");
    Esp32BaseWeb::beginPanel("设备状态");
    Esp32BaseWeb::sendNotice(LeakMonitor::hasAlert() ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                             LeakMonitor::hasAlert() ? "存在当前告警" : "设备正常",
                             LeakMonitor::hasAlert() ? "请确认现场状态，处理后再清除提示。" : "当前安全状态正常。");
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("设备", LeakMonitor::hasAlert() ? "告警" : "正常");
    Esp32BaseWeb::sendMetric("当前", WateringSession::isActive() ? "浇水中" : "空闲");
#if ESP32BASE_ENABLE_WIFI
    char rssi[16];
    snprintf(rssi, sizeof(rssi), "%ld dBm", static_cast<long>(Esp32BaseWiFi::rssi()));
    Esp32BaseWeb::sendMetric("WiFi", Esp32BaseWiFi::ssid());
    Esp32BaseWeb::sendMetric("信号", signalQuality(Esp32BaseWiFi::rssi()), rssi);
#else
    Esp32BaseWeb::sendMetric("WiFi", "-");
    Esp32BaseWeb::sendMetric("信号", "-");
#endif
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::endPanel();
    writeWateringStatusPanel("浇水状态");
    writeManualStartPanel();
    Esp32BaseWeb::beginPanel("当前告警");
    if (LeakMonitor::hasAlert()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "存在异常", "请确认现场状态，处理后清除提示。");
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/alerts/clear' onsubmit=\"return confirm('确认现场已处理并解除异常提示？')&&once(this)\"><div class='actions'><input class='danger' type='submit' value='解除异常'></div></form>");
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "无当前异常", "存在异常时在这里显示当前原因和状态；设备级诊断请查看基础库日志。");
    }
    Esp32BaseWeb::endPanel();
    sendFooter();
}

uint16_t effectivePlanRoadSec(const PlanStore::Plan& plan, uint8_t road) {
    if (road != plan.roadId || !SettingsStore::isRoadEnabled(road)) {
        return 0;
    }
    return plan.durationSec;
}

bool hasEffectivePlanRoad(const PlanStore::Plan& plan) {
    return effectivePlanRoadSec(plan, plan.roadId) > 0;
}

void writePlanContent(const PlanStore::Plan& plan, bool effectiveOnly = false) {
    const uint16_t seconds = effectiveOnly ? effectivePlanRoadSec(plan, plan.roadId) : plan.durationSec;
    if (seconds == 0) {
        Esp32BaseWeb::sendChunk(effectiveOnly ? "当前无可执行水路" : "未设置");
        return;
    }
    Esp32BaseWeb::sendChunk("第 ");
    writeUInt(plan.roadId);
    Esp32BaseWeb::sendChunk(" 路 ");
    writeRoadDisplayName(plan.roadId);
    Esp32BaseWeb::sendChunk(" ");
    writeMinutesFromSeconds(seconds);
    Esp32BaseWeb::sendChunk(" 分钟");
}

