tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
uint32_t readCycleMaskFromForm(uint8_t cycleDays) {
    uint32_t mask = 0;
    if (Esp32BaseWeb::hasParam("cycle_mask")) {
        uint32_t value = 0;
        if (readU32Param("cycle_mask", &value)) {
            mask = value;
        }
    }
    for (uint8_t i = 0; i < cycleDays; ++i) {
        char name[8];
        snprintf(name, sizeof(name), "d%u", static_cast<unsigned>(i));
        if (Esp32BaseWeb::hasParam(name)) {
            mask |= (1UL << i);
        }
    }
    return mask == 0 ? 0x01 : mask;
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint16_t raw = 0;
    const uint8_t index = (Esp32BaseWeb::hasParam("edit") && readUIntParam("edit", &raw) && raw < PlanStore::MaxPlans) ? static_cast<uint8_t>(raw) : 0;
    const PlanStore::Plan& plan = PlanStore::get(index);
    sendHeader("编辑计划", "page-form");
    writePageHead("编辑计划", "编辑单个计划的固定配置，保存后用于后续自动浇水。");
    char planTitle[40];
    snprintf(planTitle, sizeof(planTitle), "第 %u 路 / 计划 %u", static_cast<unsigned>(plan.roadId), static_cast<unsigned>(plan.slotIndex + 1));
    Esp32BaseWeb::beginPanel("计划编辑");
    Esp32BaseWeb::sendInfoRowCompactLink("计划位置", "每一路固定 6 个计划槽，计划只绑定一个水路。", planTitle, "/irrigation/plan-config", "返回");
    Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/plans' onsubmit=\"return confirm('确认保存计划？')&&once(this)\"><input type='hidden' name='index' value='");
    writeUInt(index);
    Esp32BaseWeb::sendChunk("'><h3>计划状态</h3><div class='fieldgrid'><p class='field short'><label>启用状态</label><select name='enabled'><option value='0'");
    writeSelected(!plan.enabled);
    Esp32BaseWeb::sendChunk(">停用</option><option value='1'");
    writeSelected(plan.enabled);
    Esp32BaseWeb::sendChunk(">启用</option></select><small>是否参与自动调度。</small></p><p class='field short'><label>执行时间</label><input name='time' type='time' value='");
    writeMinuteOfDay(plan.minuteOfDay);
    Esp32BaseWeb::sendChunk("'><small>按设备本地时间执行。</small></p><p class='field med'><label>水路</label><input disabled value='第 ");
    writeUInt(plan.roadId);
    Esp32BaseWeb::sendChunk(" 路 ");
    writeRoadDisplayName(plan.roadId);
    Esp32BaseWeb::sendChunk("'><small>固定计划槽所属水路。</small></p><p class='field short'><label>浇水时长</label><input name='duration_min' type='number' min='1' max='240' value='");
    writeMinutesFromSeconds(plan.durationSec);
    Esp32BaseWeb::sendChunk("'><small>分钟，范围 1-240。</small></p></div>");
    const uint32_t editCycleStartYmd = cycleStartYmdForEdit(plan);
    Esp32BaseWeb::sendChunk("<h3>循环规则</h3><div class='fieldgrid'><p class='field short'><label>循环天数</label><input id='cycleDays' name='cycle_days' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("'><small>范围 1-30 天。</small></p><p class='field med'><label>循环开始日期</label><input name='cycle_start_ymd' type='date' value='");
    writeYmd(editCycleStartYmd);
    Esp32BaseWeb::sendChunk("'><small>作为第 1 天计算循环。</small></p></div><h3>循环执行日</h3><div class='radioopts' id='cycleDayList'>");
    for (uint8_t i = 0; i < 30; ++i) {
        Esp32BaseWeb::sendChunk("<label data-day='");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk("'><input type='checkbox' name='d");
        writeUInt(i);
        Esp32BaseWeb::sendChunk("'");
        writeChecked((plan.cycleMask & (1UL << i)) != 0);
        Esp32BaseWeb::sendChunk("> 第 ");
        writeUInt(i + 1);
        Esp32BaseWeb::sendChunk(" 天</label>");
    }
    Esp32BaseWeb::sendChunk("</div><p><small class='muted'>计划只使用循环规则：每天浇水是 1 天循环；浇 2 天停 1 天是 3 天循环并执行第 1、2 天；每周固定日期是 7 天循环。</small></p><div class='actions'><input type='button' value='返回计划配置' onclick=\"location.href='/irrigation/plan-config'\"><input type='submit' value='保存计划'></div></form><script>(function(){var n=document.getElementById('cycleDays');var list=document.getElementById('cycleDayList');function sync(){var max=Math.max(1,Math.min(30,parseInt(n.value||'1',10)||1));n.value=max;list.querySelectorAll('[data-day]').forEach(function(item){var show=parseInt(item.dataset.day,10)<=max;item.style.display=show?'flex':'none';if(!show){var c=item.querySelector('input');if(c)c.checked=false;}});}if(n&&list){n.addEventListener('input',sync);sync();}})();</script>");
    Esp32BaseWeb::endPanel();
    sendFooter();
}

void writeSettingRow(const char* key, const char* label, const char* value) {
    char href[96];
    snprintf(href, sizeof(href), "/irrigation/settings?edit=%s", key ? key : "");
    Esp32BaseWeb::sendInfoRowCompactLink(label, "点击修改该业务参数。", value, href, "修改");
}

void writeSettingReadOnlyRow(const char* label, const char* value, const char* note) {
    Esp32BaseWeb::sendInfoRowCompact(label, note, value);
}

uint8_t parseQuickDurationKey(const char* key) {
    if (!key || strncmp(key, "quick_r", 7) != 0 || key[7] < '1' || key[7] > '4' || strcmp(key + 8, "_min") != 0) {
        return 0;
    }
    return static_cast<uint8_t>(key[7] - '0');
}

bool describeSettingEdit(const char* edit, char* title, size_t titleLen, char* currentValue, size_t valueLen) {
    if (!edit || edit[0] == '\0' || !title || !currentValue) {
        return false;
    }
    const SettingsStore::Settings& s = SettingsStore::current();
    uint8_t road = 0;
    if ((road = parseRoadFromKey(edit, "_enabled")) > 0) {
        snprintf(title, titleLen, "第 %u 路启用状态", static_cast<unsigned>(road));
        snprintf(currentValue, valueLen, "%s", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        return true;
    }
    if ((road = parseRoadFromKey(edit, "_name")) > 0) {
        snprintf(title, titleLen, "第 %u 路名称", static_cast<unsigned>(road));
        snprintf(currentValue, valueLen, "%s", s.roads[road - 1].name[0] ? s.roads[road - 1].name : "未命名");
        return true;
    }
    if ((road = parseQuickDurationKey(edit)) > 0) {
        snprintf(title, titleLen, "第 %u 路默认时长", static_cast<unsigned>(road));
        snprintf(currentValue, valueLen, "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        return true;
    }
    if ((road = parseRoadFromKey(edit, "_pulse_per_liter")) > 0) {
        snprintf(title, titleLen, "第 %u 路每升脉冲", static_cast<unsigned>(road));
        snprintf(currentValue, valueLen, "%u pulse/L", static_cast<unsigned>(s.roads[road - 1].pulsePerLiter));
        return true;
    }
    if ((road = parseRoadFromKey(edit, "_calibration_x1000")) > 0) {
        snprintf(title, titleLen, "第 %u 路校准系数", static_cast<unsigned>(road));
        snprintf(currentValue, valueLen, "%u", static_cast<unsigned>(s.roads[road - 1].calibrationX1000));
        return true;
    }
    if (strcmp(edit, "flow_no_pulse_timeout_s") == 0) {
        snprintf(title, titleLen, "无脉冲超时");
        snprintf(currentValue, valueLen, "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
        return true;
    }
    if (strcmp(edit, "idle_leak_window_s") == 0) {
        snprintf(title, titleLen, "漏水窗口");
        snprintf(currentValue, valueLen, "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
        return true;
    }
    if (strcmp(edit, "idle_leak_pulse_threshold") == 0) {
        snprintf(title, titleLen, "漏水脉冲阈值");
        snprintf(currentValue, valueLen, "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
        return true;
    }
    return false;
}

void writeSettingEditFields(const char* edit) {
    const SettingsStore::Settings& s = SettingsStore::current();
    uint8_t road = parseRoadFromKey(edit, "_enabled");
    if (road > 0) {
        Esp32BaseWeb::sendChunk("<input type='hidden' name='road' value='");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("'><p class='field med'><label>启用状态</label><select name='enabled'><option value='1'");
        writeSelected(SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">已启用</option><option value='0'");
        writeSelected(!SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(">未启用</option></select><small>停用后该路不会被手动或计划任务启动。</small></p>");
    } else if ((road = parseRoadFromKey(edit, "_name")) > 0) {
        Esp32BaseWeb::sendChunk("<p class='field med'><label>名称</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_name' maxlength='11' value='");
        Esp32BaseWeb::writeHtmlEscaped(s.roads[road - 1].name);
        Esp32BaseWeb::sendChunk("'><small>用于页面和记录展示。</small></p>");
    } else if ((road = parseQuickDurationKey(edit)) > 0) {
        Esp32BaseWeb::sendChunk("<p class='field short'><label>默认时长</label><input name='quick_r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_min' type='number' min='1' max='240' value='");
        writeMinutesFromSeconds(s.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk("'><small>分钟，范围 1-240。</small></p>");
    } else if ((road = parseRoadFromKey(edit, "_pulse_per_liter")) > 0) {
        Esp32BaseWeb::sendChunk("<p class='field short'><label>每升脉冲</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_pulse_per_liter' type='number' min='1' max='10000' value='");
        writeUInt(s.roads[road - 1].pulsePerLiter);
        Esp32BaseWeb::sendChunk("'><small>流量计 pulse/L。</small></p>");
    } else if ((road = parseRoadFromKey(edit, "_calibration_x1000")) > 0) {
        Esp32BaseWeb::sendChunk("<p class='field short'><label>校准系数</label><input name='r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("_calibration_x1000' type='number' min='100' max='10000' value='");
        writeUInt(s.roads[road - 1].calibrationX1000);
        Esp32BaseWeb::sendChunk("'><small>1000 表示 1.000 倍。</small></p>");
    } else if (strcmp(edit, "flow_no_pulse_timeout_s") == 0 || strcmp(edit, "idle_leak_window_s") == 0 || strcmp(edit, "idle_leak_pulse_threshold") == 0) {
        uint16_t current = s.flowNoPulseTimeoutSec;
        const char* label = "无脉冲超时";
        uint16_t max = 60;
        if (strcmp(edit, "idle_leak_window_s") == 0) {
            current = s.idleLeakWindowSec;
            label = "漏水窗口";
        } else if (strcmp(edit, "idle_leak_pulse_threshold") == 0) {
            current = s.idleLeakPulseThreshold;
            label = "漏水脉冲阈值";
            max = 100;
        }
        Esp32BaseWeb::sendChunk("<p class='field short'><label>");
        Esp32BaseWeb::writeHtmlEscaped(label);
        Esp32BaseWeb::sendChunk("</label><input name='");
        Esp32BaseWeb::writeHtmlEscaped(edit);
        Esp32BaseWeb::sendChunk("' type='number' min='1' max='");
        writeUInt(max);
        Esp32BaseWeb::sendChunk("' value='");
        writeUInt(current);
        Esp32BaseWeb::sendChunk("'><small>范围 1-");
        writeUInt(max);
        Esp32BaseWeb::sendChunk("。</small></p>");
    }
}

void writeSettingEditPanel(const char* edit) {
    if (!edit || edit[0] == '\0') {
        return;
    }
    char title[48];
    char currentValue[64];
    if (!describeSettingEdit(edit, title, sizeof(title), currentValue, sizeof(currentValue))) {
        Esp32BaseWeb::beginPanel("修改设置");
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "未知设置项", "请返回设置列表重新选择需要修改的项目。");
        Esp32BaseWeb::sendInfoRowCompactLink("设置列表", "返回可编辑的灌溉业务参数。", nullptr, "/irrigation/settings", "返回");
        Esp32BaseWeb::endPanel();
        return;
    }
    Esp32BaseWeb::beginPanel("修改设置");
    Esp32BaseWeb::sendInfoRowCompact("当前项目", title, currentValue);
    Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/irrigation/settings/config' onsubmit=\"return confirm('确认保存设置？')&&once(this)\"><div class='fieldgrid'>");
    writeSettingEditFields(edit);
    Esp32BaseWeb::sendChunk("</div><div class='actions'><input type='button' value='取消' onclick=\"location.href='/irrigation/settings'\"><input type='submit' value='保存'></div></form>");
    Esp32BaseWeb::endPanel();
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    const SettingsStore::Settings& s = SettingsStore::current();
    sendHeader("灌溉设置", "page-settings");
    writePageHead("灌溉设置", "查看和修改水路、流量计量、默认浇水和安全检测参数。");
    char edit[32] = "";
    (void)Esp32BaseWeb::getParam("edit", edit, sizeof(edit));
    char value[32];
    Esp32BaseWeb::beginPanel("灌溉设置");
    snprintf(value, sizeof(value), "%u 路", static_cast<unsigned>(SettingsStore::enabledRoads()));
    writeSettingReadOnlyRow("已启用路数", value, "由各路启用状态计算");
    writeSettingReadOnlyRow("阀门 PWM", "启动 5 秒后 70%", "固定硬件策略");
    Esp32BaseWeb::endPanel();
    char key[32];
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        const SettingsStore::RoadConfig& r = s.roads[road - 1];
        char panelTitle[24];
        snprintf(panelTitle, sizeof(panelTitle), "第 %u 路配置", static_cast<unsigned>(road));
        Esp32BaseWeb::beginPanel(panelTitle);
        snprintf(key, sizeof(key), "r%u_enabled", static_cast<unsigned>(road));
        writeSettingRow(key, "启用状态", SettingsStore::isRoadEnabled(road) ? "已启用" : "未启用");
        snprintf(key, sizeof(key), "r%u_name", static_cast<unsigned>(road));
        writeSettingRow(key, "名称", r.name[0] ? r.name : "未命名");
        writeSettingReadOnlyRow("阀门引脚", valvePinName(road), "固定硬件配置");
        writeSettingReadOnlyRow("流量引脚", flowPinName(road), "固定硬件配置");
        snprintf(key, sizeof(key), "quick_r%u_min", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u 分钟", static_cast<unsigned>(s.quickDurationSec[road - 1] / 60U));
        writeSettingRow(key, "默认时长", value);
        snprintf(key, sizeof(key), "r%u_pulse_per_liter", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u pulse/L", static_cast<unsigned>(r.pulsePerLiter));
        writeSettingRow(key, "每升脉冲", value);
        snprintf(key, sizeof(key), "r%u_calibration_x1000", static_cast<unsigned>(road));
        snprintf(value, sizeof(value), "%u", static_cast<unsigned>(r.calibrationX1000));
        writeSettingRow(key, "校准系数", value);
        Esp32BaseWeb::endPanel();
    }
    Esp32BaseWeb::beginPanel("水流检测");
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.flowNoPulseTimeoutSec));
    writeSettingRow("flow_no_pulse_timeout_s", "无脉冲超时", value);
    snprintf(value, sizeof(value), "%u 秒", static_cast<unsigned>(s.idleLeakWindowSec));
    writeSettingRow("idle_leak_window_s", "漏水窗口", value);
    snprintf(value, sizeof(value), "%u", static_cast<unsigned>(s.idleLeakPulseThreshold));
    writeSettingRow("idle_leak_pulse_threshold", "漏水脉冲阈值", value);
    Esp32BaseWeb::endPanel();
    writeSettingEditPanel(edit);
    sendFooter();
}

void handleDataPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint16_t page = 1;
    uint16_t perPage = 10;
    if (Esp32BaseWeb::hasParam("page") && (!readUIntParam("page", &page) || page == 0)) {
        page = 1;
    }
    if (Esp32BaseWeb::hasParam("per") && (!readUIntParam("per", &perPage) || (perPage != 10 && perPage != 20 && perPage != 50))) {
        perPage = 10;
    }
    const uint16_t total = RecordStore::count();
    const uint16_t totalPages = total == 0 ? 1 : static_cast<uint16_t>((total + perPage - 1) / perPage);
    if (page > totalPages) {
        page = totalPages;
    }
    const uint16_t offset = static_cast<uint16_t>((page - 1) * perPage);
    sendHeader("历史记录", "page-table");
    writePageHead("历史记录", "查看每一次浇水任务的来源、停止来源、执行结果和实际水量。");
    Esp32BaseWeb::beginPanel("浇水记录");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>路</th><th>任务</th><th>启动来源</th><th>停止来源</th><th>结果</th><th>目标</th><th>实际</th><th>水量</th></tr></thead><tbody>");
    uint16_t rendered = 0;
    auto recordCb = [](const RecordStore::Record& record, void* user) {
        uint16_t* renderedRows = static_cast<uint16_t*>(user);
        if (renderedRows) {
            ++(*renderedRows);
        }
        const uint32_t actualSec = record.endedMs >= record.startedMs && record.startedMs > 0 ? (record.endedMs - record.startedMs) / 1000UL : 0;
        Esp32BaseWeb::sendChunk("<tr><td>");
        writeUInt(record.id);
        Esp32BaseWeb::sendChunk("</td><td>第 ");
        writeUInt(record.roadId);
        Esp32BaseWeb::sendChunk(" 路</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::taskTypeName(static_cast<RecordStore::TaskType>(record.taskType)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.startSource)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.stopSource)));
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::sendChunk("<span class='tag");
        Esp32BaseWeb::sendChunk(record.result == RecordStore::RESULT_COMPLETED ? " ok" : (record.result == RecordStore::RESULT_NONE ? "" : " warn"));
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::writeHtmlEscaped(RecordStore::resultName(static_cast<RecordStore::Result>(record.result)));
        Esp32BaseWeb::sendChunk("</span>");
        Esp32BaseWeb::sendChunk("</td><td>");
        writeMinutesFromSeconds(record.targetSec);
        Esp32BaseWeb::sendChunk(" 分钟</td><td>");
        writeUInt(actualSec);
        Esp32BaseWeb::sendChunk(" 秒</td><td>");
        writeLitersFromMl(record.estimatedMilliliters);
        Esp32BaseWeb::sendChunk("</td></tr>");
    };
    (void)RecordStore::readLatest(offset, perPage, recordCb, &rendered);
    if (rendered == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='9'><span class='muted'>暂无浇水记录</span></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::Pagination pagination = {"/irrigation/data", nullptr, page, perPage, total};
    Esp32BaseWeb::sendPagination(pagination);
    Esp32BaseWeb::endPanel();
    sendFooter();
}

void writeSettingsJson() {
    const SettingsStore::Settings& s = SettingsStore::current();
    Esp32BaseWeb::sendChunk("\"settings\":{\"enabled_roads\":");
    writeUInt(SettingsStore::enabledRoads());
    Esp32BaseWeb::sendChunk(",\"road_enabled_mask\":");
    writeUInt(SettingsStore::roadEnabledMask());
    Esp32BaseWeb::sendChunk(",\"flow_no_pulse_timeout_s\":");
    writeUInt(s.flowNoPulseTimeoutSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_window_s\":");
    writeUInt(s.idleLeakWindowSec);
    Esp32BaseWeb::sendChunk(",\"idle_leak_pulse_threshold\":");
    writeUInt(s.idleLeakPulseThreshold);
    Esp32BaseWeb::sendChunk(",\"roads\":{");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        if (road > 1) Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::sendChunk("\"r");
        writeUInt(road);
        Esp32BaseWeb::sendChunk("\":{\"enabled\":");
        writeBool(SettingsStore::isRoadEnabled(road));
        Esp32BaseWeb::sendChunk(",\"name\":\"");
        Esp32BaseWeb::writeJsonEscaped(s.roads[road - 1].name);
        Esp32BaseWeb::sendChunk("\",\"valve_pin\":\"");
        Esp32BaseWeb::writeJsonEscaped(valvePinName(road));
        Esp32BaseWeb::sendChunk("\",\"flow_pin\":\"");
        Esp32BaseWeb::writeJsonEscaped(flowPinName(road));
        Esp32BaseWeb::sendChunk("\",\"quick_duration_sec\":");
        writeUInt(s.quickDurationSec[road - 1]);
        Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
        writeUInt(s.roads[road - 1].pulsePerLiter);
        Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
        writeUInt(s.roads[road - 1].calibrationX1000);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("}}");
}

