tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleConfigApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        beginJson();
        Esp32BaseWeb::sendChunk("{");
        writeSettingsJson();
        Esp32BaseWeb::sendChunk("}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    const char* error = nullptr;
    if (!saveConfigFromRequest(&error)) {
        sendConfigError(error);
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void handleSettingsConfigForm() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    const char* error = nullptr;
    if (!saveConfigFromRequest(&error)) {
        sendConfigError(error);
        return;
    }
    redirectTo("/irrigation/settings");
}

void handleWaterStartApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    const bool pageRequest = isWebPageSourceParam();
    const RecordStore::TriggerSource source = requestTriggerSource();
    bool anyRequested = false;
    bool anyStarted = false;
    bool anyInvalid = false;
    const char* result[IrrigationPins::MaxRoads] = {};
    uint16_t requestedSec[IrrigationPins::MaxRoads] = {};
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        bool useRoad = SettingsStore::isRoadEnabled(road);
        char key[16];
        snprintf(key, sizeof(key), "r%u_enabled", static_cast<unsigned>(road));
        (void)readBoolParam(key, &useRoad);
        if (!useRoad) {
            result[road - 1] = "not_requested";
            continue;
        }
        anyRequested = true;
        if (!SettingsStore::isRoadEnabled(road)) {
            result[road - 1] = "disabled";
            continue;
        }
        snprintf(key, sizeof(key), "r%u_min", static_cast<unsigned>(road));
        uint16_t minutes = 0;
        if (!readUIntParam(key, &minutes) || minutes < 1 || minutes > 240) {
            result[road - 1] = "invalid_duration";
            anyInvalid = true;
            continue;
        }
        requestedSec[road - 1] = minutesToSeconds(minutes);
        if (WateringSession::isRoadActive(road)) {
            result[road - 1] = "busy";
            continue;
        }
        const bool started = WateringSession::startRoadTask(road, requestedSec[road - 1], RecordStore::TASK_MANUAL, source, 0xFF, pageRequest ? "web page manual" : "http api manual");
        result[road - 1] = started ? "started" : "rejected";
        anyStarted = started || anyStarted;
    }
    if (pageRequest && anyStarted) {
        redirectTo("/irrigation");
        return;
    }
    beginJson(anyStarted ? 200 : 400);
    Esp32BaseWeb::sendChunk("{\"ok\":");
    writeBool(anyStarted);
    Esp32BaseWeb::sendChunk(",\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(anyStarted ? "" : (anyInvalid ? "invalid_duration" : (anyRequested ? "no_road_started" : "no_road_requested")));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::triggerSourceName(source));
    Esp32BaseWeb::sendChunk("\",\"roads\":[");
    for (uint8_t road = 1; road <= IrrigationPins::MaxRoads; ++road) {
        if (road > 1) Esp32BaseWeb::sendChunk(",");
        Esp32BaseWeb::sendChunk("{\"road\":");
        writeUInt(road);
        Esp32BaseWeb::sendChunk(",\"result\":\"");
        Esp32BaseWeb::writeJsonEscaped(result[road - 1] ? result[road - 1] : "not_requested");
        Esp32BaseWeb::sendChunk("\",\"target_sec\":");
        writeUInt(requestedSec[road - 1]);
        Esp32BaseWeb::sendChunk("}");
    }
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleWaterStopApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    uint16_t road = 0;
    (void)readUIntParam("road", &road);
    const bool pageRequest = isWebPageSourceParam();
    const RecordStore::TriggerSource source = requestTriggerSource();
    bool stopped = false;
    if (road == 0) {
        stopped = WateringSession::isActive();
        WateringSession::stopAll(source, RecordStore::RESULT_USER_STOPPED, pageRequest ? "web page stop all" : "http api stop all");
    } else if (road <= IrrigationPins::MaxRoads) {
        stopped = WateringSession::stopRoad(static_cast<uint8_t>(road), source, pageRequest ? "web page stop road" : "http api stop road");
    } else {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_road\"}");
        return;
    }
    if (pageRequest) {
        redirectTo("/irrigation");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"stopped\":");
    writeBool(stopped);
    Esp32BaseWeb::sendChunk(",\"road\":");
    writeUInt(road);
    Esp32BaseWeb::sendChunk(",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::triggerSourceName(source));
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

void handleAlertsClearApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    LeakMonitor::clearAlerts(EventStore::SOURCE_WEB);
    redirectTo("/irrigation");
}

void handlePlansApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        beginJson();
        Esp32BaseWeb::sendChunk("{\"count\":");
        writeUInt(PlanStore::MaxPlans);
        Esp32BaseWeb::sendChunk(",\"plans\":[");
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            if (i) Esp32BaseWeb::sendChunk(",");
            writePlanJson(i, PlanStore::get(i));
        }
        Esp32BaseWeb::sendChunk("]}");
        endJson();
        return;
    }
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("GET,POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    uint16_t indexRaw = 0;
    if (!readUIntParam("index", &indexRaw) || indexRaw >= PlanStore::MaxPlans) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_index\"}");
        return;
    }
    PlanStore::Plan plan = PlanStore::get(static_cast<uint8_t>(indexRaw));
    bool enabled = false;
    uint16_t value = 0;
    if (readBoolParam("enabled", &enabled)) plan.enabled = enabled;
    if (Esp32BaseWeb::hasParam("time") && !readMinuteOfDayParam("time", &plan.minuteOfDay)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_time\"}");
        return;
    }
    if (Esp32BaseWeb::hasParam("duration_min")) {
        uint16_t seconds = 0;
        if (!readDurationSecondsParam("duration_min", &seconds)) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_duration\"}");
            return;
        }
        plan.durationSec = seconds;
    }
    if (Esp32BaseWeb::hasParam("cycle_days")) {
        if (!readUIntParam("cycle_days", &value) || value < 1 || value > 30) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_cycle\"}");
            return;
        }
        plan.cycleDays = static_cast<uint8_t>(value);
    }
    uint32_t ymd = 0;
    if (Esp32BaseWeb::hasParam("cycle_start_ymd")) {
        if (!readYmdParam("cycle_start_ymd", &ymd)) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_cycle_start\"}");
            return;
        }
        plan.cycleStartYmd = ymd;
    }
    plan.cycleMask = readCycleMaskFromForm(plan.cycleDays);
    if (!PlanStore::set(static_cast<uint8_t>(indexRaw), plan)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_plan\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, indexRaw, plan.cycleDays, "plan saved");
    redirectTo("/irrigation/plan-config");
}

void handleRecentPlansApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"plans\":[");
    bool first = true;
    bool timeSynced = true;
    for (int8_t offset = 0; offset <= 2; ++offset) {
        tm date = {};
        if (!localDateFromOffset(offset, &date)) {
            timeSynced = false;
            break;
        }
        const uint32_t ymd = makeYmd(date);
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            (void)writeRecentPlanJson(i, dayLabel(offset), offset, ymd, &first);
        }
    }
    Esp32BaseWeb::sendChunk("],\"time_synced\":");
    writeBool(timeSynced);
    Esp32BaseWeb::sendChunk("}");
    endJson();
}

void handlePlanSkipApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        sendMethodNotAllowed("POST");
        return;
    }
    if (rejectIfFactoryResetPending()) {
        return;
    }
    char action[16] = "";
    uint32_t ymd = 0;
    const bool pageRequest = isWebPageSourceParam();
    if (!Esp32BaseWeb::getParam("action", action, sizeof(action)) || !readU32Param("ymd", &ymd)) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"invalid_skip_request\"}");
        return;
    }
    bool ok = true;
    if (strcmp(action, "skip_once") == 0 || strcmp(action, "clear_skip") == 0) {
        uint16_t index = 0;
        ok = readUIntParam("index", &index) && index < PlanStore::MaxPlans;
        if (ok) {
            if (strcmp(action, "skip_once") == 0) {
                ok = PlanSkipStore::setSkipped(static_cast<uint8_t>(index), ymd) &&
                     PlanResultStore::setResult(static_cast<uint8_t>(index), ymd, PlanResultStore::RESULT_SKIPPED_MANUAL);
            } else {
                ok = PlanSkipStore::clearSkipped(static_cast<uint8_t>(index), ymd) &&
                     PlanResultStore::clearResult(static_cast<uint8_t>(index), ymd);
            }
        }
    } else if (strcmp(action, "skip_day") == 0) {
        char scope[12] = "all";
        (void)Esp32BaseWeb::getParam("scope", scope, sizeof(scope));
        const uint32_t today = currentYmd();
        const bool wantsRemaining = strcmp(scope, "remaining") == 0;
        if (wantsRemaining && today == 0) {
            Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"time_not_synced\"}");
            return;
        }
        const bool remaining = wantsRemaining && ymd == today;
        const uint16_t nowMinute = currentMinuteOfDay();
        for (uint8_t i = 0; i < PlanStore::MaxPlans; ++i) {
            const PlanStore::Plan& plan = PlanStore::get(i);
            if (!plan.enabled || !PlanStore::shouldRunOnDate(plan, ymd) || plan.lastRunYmd == ymd) continue;
            if (remaining && plan.minuteOfDay <= nowMinute) continue;
            ok = PlanSkipStore::setSkipped(i, ymd) &&
                 PlanResultStore::setResult(i, ymd, PlanResultStore::RESULT_SKIPPED_MANUAL) &&
                 ok;
        }
    } else {
        ok = false;
    }
    if (!ok) {
        Esp32BaseWeb::sendJson(400, "{\"ok\":false,\"error\":\"skip_failed\"}");
        return;
    }
    (void)EventStore::append(EventStore::TYPE_PLAN_CHANGED, EventStore::SOURCE_WEB, 0, 0, static_cast<int32_t>(ymd), 0, action);
    if (pageRequest) {
        redirectTo("/irrigation/plans");
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

void writeRecordJson(const RecordStore::Record& record, void* user) {
    bool* first = static_cast<bool*>(user);
    if (!*first) Esp32BaseWeb::sendChunk(",");
    *first = false;
    const uint32_t pulses = record.endedPulseCount >= record.startedPulseCount ? record.endedPulseCount - record.startedPulseCount : 0;
    const uint32_t actualSec = record.endedMs >= record.startedMs && record.startedMs > 0 ? (record.endedMs - record.startedMs) / 1000UL : 0;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(record.id);
    Esp32BaseWeb::sendChunk(",\"road_id\":");
    writeUInt(record.roadId);
    Esp32BaseWeb::sendChunk(",\"task_type\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::taskTypeName(static_cast<RecordStore::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("\",\"start_source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.startSource)));
    Esp32BaseWeb::sendChunk("\",\"stop_source\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::triggerSourceName(static_cast<RecordStore::TriggerSource>(record.stopSource)));
    Esp32BaseWeb::sendChunk("\",\"stop_scope\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::stopScopeName(static_cast<RecordStore::StopScope>(record.stopScope)));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::writeJsonEscaped(RecordStore::resultName(static_cast<RecordStore::Result>(record.result)));
    Esp32BaseWeb::sendChunk("\",\"plan_slot\":");
    writeUInt(record.planSlot);
    Esp32BaseWeb::sendChunk(",\"enabled_roads\":");
    writeUInt(record.enabledRoads);
    Esp32BaseWeb::sendChunk(",\"flow_no_pulse_timeout_s\":");
    writeUInt(record.flowNoPulseTimeoutSec);
    Esp32BaseWeb::sendChunk(",\"target_sec\":");
    writeUInt(record.targetSec);
    Esp32BaseWeb::sendChunk(",\"actual_sec\":");
    writeUInt(actualSec);
    Esp32BaseWeb::sendChunk(",\"started_ms\":");
    writeUInt(record.startedMs);
    Esp32BaseWeb::sendChunk(",\"ended_ms\":");
    writeUInt(record.endedMs);
    Esp32BaseWeb::sendChunk(",\"started_pulses\":");
    writeUInt(record.startedPulseCount);
    Esp32BaseWeb::sendChunk(",\"ended_pulses\":");
    writeUInt(record.endedPulseCount);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(pulses);
    Esp32BaseWeb::sendChunk(",\"pulse_per_liter\":");
    writeUInt(record.pulsePerLiter);
    Esp32BaseWeb::sendChunk(",\"calibration_x1000\":");
    writeUInt(record.calibrationX1000);
    Esp32BaseWeb::sendChunk(",\"estimated_ml\":");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk("}");
}

void handleRecordsApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson();
    Esp32BaseWeb::sendChunk("{\"count\":");
    writeUInt(RecordStore::count());
    Esp32BaseWeb::sendChunk(",\"capacity\":");
    writeUInt(RecordStore::capacity());
    Esp32BaseWeb::sendChunk(",\"records\":[");
    bool first = true;
    (void)RecordStore::readLatest(0, readLimitParam(20, 50), writeRecordJson, &first);
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

